In [2]:
import pandas as pd

##### Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Actions/Prescription

#### Problems Encountered
1. Columns name are not given - names operator is used
2. File is tab seperated - sep operator is used

In [2]:
#Column Names
cols = ['user_id', 'movie_id', 'rating', 'ts']

In [3]:
#Reading File1
df = pd.read_csv('u.data', sep = '\t', names = cols)

In [4]:
a = [4,8,2,7,9]

In [5]:
b = []
for i in a:
    b.append(i*2)
b

[8, 16, 4, 14, 18]

In [6]:
b = [i*2 for i in a]
b

[8, 16, 4, 14, 18]

In [4]:
item_cols = ['movie_id', 'title'] + [str(i) for i in range(22)]

In [5]:
#Reading File2
df1 = pd.read_csv('u.item', sep = '|', names = item_cols, encoding = "ISO-8859-1")[['movie_id', 'title']]
df1

      movie_id                                      title
0            1                           Toy Story (1995)
1            2                           GoldenEye (1995)
2            3                          Four Rooms (1995)
3            4                          Get Shorty (1995)
4            5                             Copycat (1995)
...        ...                                        ...
1677      1678                          Mat' i syn (1997)
1678      1679                           B. Monkey (1998)
1679      1680                       Sliding Doors (1998)
1680      1681                        You So Crazy (1994)
1681      1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [9]:
df1.shape

(1682, 2)

#### Exploratory Data Analysis (EDA)

In [10]:
df1.sample(5)

      movie_id                                  title
1632      1633     Á köldum klaka (Cold Fever) (1994)
1252      1253             Tie That Binds, The (1995)
142        143             Sound of Music, The (1965)
1076      1077                  Love and a .45 (1994)
1127      1128  Heidi Fleiss: Hollywood Madam (1995)

In [11]:
#Sample Data
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [12]:
#Sample Data
df.sample(5)

       user_id  movie_id  rating         ts
32631      198       191       4  884208682
91313      632       468       3  879457925
17277      178       619       3  888514710
54654      226       509       4  883889322
10690      290       498       4  880473777

In [13]:
#Tells the structure of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [14]:
#Gives the statistics of the given data
#or
#Describes the data
df.describe(include = 'all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

#### Segregating the Data
1. Strings with categorical Info
2. Strings with Random Stuff
3. Numbers with Quantified Info
4. Numbers with Categorical Info
5. Random Numbers or ID Sort of data

In [15]:
#Unique Ratings
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [16]:
#Checking the number of unique users
df['user_id'].nunique()

944

In [17]:
#Checking the Number of unique movies
df['movie_id'].nunique()

1682

In [18]:
#Merging the Data Frames

In [19]:
movie = pd.merge(df, df1, on = 'movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [20]:
#Remove the redundant or useless columns i.e. ts
movie.drop('ts', axis = 1, inplace = True)

In [21]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [22]:
#Finding the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [23]:
#Finding the average rating for each movi
movie.groupby('title')['rating'].mean().sort_values(ascending = False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [24]:
#Converting Pandas Series to DataFrame
ratings = pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending = False))

In [25]:
#Adding a new column named rating in the exisiting DataFrame
ratings['count'] = movie['title'].value_counts()

In [26]:
ratings.head(10)

                                                   rating  count
title
They Made Me a Criminal (1939)                        5.0      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1
Saint of Fort Washington, The (1993)                  5.0      2
Someone Else's America (1995)                         5.0      1
Star Kid (1997)                                       5.0      3
Great Day in Harlem, A (1994)                         5.0      1
Aiqing wansui (1994)                                  5.0      1
Santa with Muscles (1996)                             5.0      2
Prefontaine (1997)                                    5.0      3
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1

In [27]:
#Sorting the values in DataFrame by value counts
ratings.sort_values(by = 'count', ascending=False).head(10)

                                 rating  count
title
Star Wars (1977)               4.359589    584
Contact (1997)                 3.803536    509
Fargo (1996)                   4.155512    508
Return of the Jedi (1983)      4.007890    507
Liar Liar (1997)               3.156701    485
English Patient, The (1996)    3.656965    481
Scream (1996)                  3.441423    478
Toy Story (1995)               3.878319    452
Air Force One (1997)           3.631090    431
Independence Day (ID4) (1996)  3.438228    429